In [1]:
import pandas as pd 
x=[1,2,3,4]
var=pd.Series(x)
var

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
#getting first 3 rows

df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [7]:
#check last 3 rows of the dataset
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [11]:
#find shape of dataset
df1.shape

(7, 3)

In [15]:
print("no of rows" , df1.shape[0])
print("no of cols" , df1.shape[1])

no of rows 7
no of cols 3

In [17]:
# info about data rows,cols,memory required,datatype
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [19]:
#check null values in dataset
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [21]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [23]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [25]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [27]:
#get overall statistics
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [29]:
#get overall statistics
df1.describe(include="all") #'all'

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [31]:
# Describe all columns (including non-numeric types)
print(df1.describe(include='all'))

# Describe only numeric columns
print(df1.describe(include=[int, float]))

# Describe only object (string-like) columns
print(df1.describe(include=[object]))

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN
           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000
           Name  Gender
count         7       7
unique        7       2
top     Priyang  Female
freq          1       4

In [35]:
#find unique values from gender column
df1
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [37]:
#find no of unique values from gender column
df1['Gender'].unique()

2

In [39]:
#display count  of unique values from gender column
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [41]:
#total no of students having marks above 90
df1['Marks']<=90
#return boolean values indicating whether each row satisfies the condition:

0    False
1     True
2    False
3     True
4     True
5     True
6    False
Name: Marks, dtype: bool

In [43]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [45]:
df1[df1['Marks']<=90]

     Name  Marks  Gender
1  Aadhya     89  Female
3  Vedant     87    Male
4  Parshv     90    Male
5  Mittal     83  Female

In [49]:
# if we've 2 to more conditions we've to write paranthesis
(df1['Marks']>=90) & (df1['Marks']<=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [51]:
(df1['Marks']>=90) | (df1['Marks']<=100)

0    True
1    True
2    True
3    True
4    True
5    True
6    True
Name: Marks, dtype: bool

In [53]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [55]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [57]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [59]:
#using between
#whether the values in a specific column or Series lie within a specified range
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [61]:
sum(df1['Marks'].between(90,100))

4

In [63]:
#inclusive (optional): Determines whether the bounds are included
print("Inclusive of both bounds:")
print(df1['Marks'].between(90, 100))

# Excluding both bounds
print("\nExcluding both bounds:")
print(df1['Marks'].between(90, 100, inclusive='neither'))

# Including only the lower bound
print("\nIncluding only the lower bound:")
print(df1['Marks'].between(90, 100, inclusive='left'))

# Including only the upper bound
print("\nIncluding only the upper bound:")
print(df1['Marks'].between(90, 100, inclusive='right'))

Inclusive of both bounds:
0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

Excluding both bounds:
0     True
1    False
2     True
3    False
4    False
5    False
6     True
Name: Marks, dtype: bool

Including only the lower bound:
0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

Including only the upper bound:
0     True
1    False
2     True
3    False
4    False
5    False
6     True
Name: Marks, dtype: bool

In [65]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [71]:
df1['Marks'].mean()

92.14285714285714

In [73]:
df1['Marks'].min()

83

In [75]:
df1['Marks'].max()

99

#apply method

In [96]:
def marks(x):
    return x//2

In [98]:
df1['Half_Marks']=df1['Marks'].apply(marks)
#add new column

In [100]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [102]:
#1 line reqired using anonymous function
#A lambda function that takes an element x and divides it by 2.
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [106]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

MAp function

In [109]:
df1['Gender'].map({'Male':1,'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [130]:
#.map() is often used for data preprocessing tasks like label encoding or
#transforming categorical data into numerical values for machine learning.
df1['Male_Female']=df1['Gender'].map({'Male':1,'Female':0})

In [132]:
df1
#if we it more than once or creating the column multiple times.
#Pandas will add a new column each time the operation is performed, causing duplicate columns.

      Name  Marks  Gender  Half_Marks  MAle_Female  Male_Female
0  Priyang     98    Male          49            1            1
1   Aadhya     89  Female          44            0            0
2   Krisha     99  Female          49            0            0
3   Vedant     87    Male          43            1            1
4   Parshv     90    Male          45            1            1
5   Mittal     83  Female          41            0            0
6  Archana     99  Female          49            0            0

In [134]:

# Check if 'Male_Female' column exists
if 'MAle_Female' in df1.columns:
    # Drop the existing 'Male_Female' column
    df1 = df1.drop(columns=['MAle_Female'])

# Now apply the mapping to create the 'Male_Female' column
df1['Male_Female'] = df1['Gender'].map({'Male': 1, 'Female': 0})

# Display the DataFrame
print(df1)

      Name  Marks  Gender  Half_Marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

In [142]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [146]:
df1.drop(['Male_Female','Half_Marks'],axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [148]:
df1.drop(['Male_Female','Half_Marks'],axis=1 , inplace=True)
#inplace permanently removed but without it madae copy

In [ ]:
#without inplace 
# Dropping 'Gender' without inplace
df2 = df1.drop(['Gender'], axis=1)

# Recovering 'Gender' column (because df1 was not modified)
df1 = df2.copy()  # if you want to continue working with the modified df2
df1['Gender'] = dict1['Gender']  # Re-adding the 'Gender' column

print(df1)

In [150]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [152]:
#print names of coluns
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [154]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [170]:
#sort dataframe as per mark columns
df1.sort_values(by='Marks')

      Name  Marks
5   Mittal     83
3   Vedant     87
1   Aadhya     89
4   Parshv     90
0  Priyang     98
2   Krisha     99
6  Archana     99

In [172]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks
2   Krisha     99
6  Archana     99
0  Priyang     98
4   Parshv     90
1   Aadhya     89
3   Vedant     87
5   Mittal     83

In [174]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1
#if we use inplacae true then weve to sue data again

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [178]:
df1.sort_values(by=['Marks','Gender'] ,ascending=False)
#1stly sort by marks the gender

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [15]:
import pandas as pd
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [17]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [21]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [23]:
#2nd method
df1['Gender'].isin(['Female'])

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [27]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99